app/views/hunts/_hunt.html.erb

SELECT  1 AS one FROM "pirate_hunts" WHERE "pirate_hunts"."hunt_id" = ? AND "pirate_hunts"."user_id" = ? LIMIT 1  [["hunt_id", 1], ["user_id", 1]]
SELECT "hunts".* FROM "hunts" WHERE "hunts"."user_id" = ?  [["user_id", 1]]
---
  <span class="title"><%=link_to hunt.title, hunt %></span>
  <!--<% unless hunt.pirate_hunts.exists?(:user_id => current_user.id)%>