app/views/pirate_hunts/show.html.erb

    </div>
    <% @pirate_hunt.hunt.pirate_hunts.joins(:user).order("points DESC").each do |s| %>
---
SELECT "pirate_hunts".* FROM "pirate_hunts" INNER JOIN "users" ON "users"."id" = "pirate_hunts"."user_id" WHERE "pirate_hunts"."hunt_id" = ?  ORDER BY points DESC  [["hunt_id", 3]]