app/controllers/hunts_controller.rb

  def index
    @hunts = Hunt.where(published: true, public: true) #for 'browse all' page
---
SELECT "hunts".* FROM "hunts" WHERE "hunts"."published" = 't' AND "hunts"."public" = 't'