app/controllers/hunts_controller.rb

INSERT INTO "hunts" ("title", "public", "published", "active", "start_date", "start_time", "end_date", "end_time", "start_location", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @hunt = Hunt.new(hunt_params)

    if @hunt.save

SELECT "hunts".* FROM "hunts" WHERE (title LIKE '%shan%' OR user_id LIKE '%shan%' OR start_location LIKE '%shan%')  ORDER BY created_at DESC
---
  def index
    @hunts = Hunt.all

SELECT  "hunts".* FROM "hunts" WHERE "hunts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "pirate_tasks".* FROM "pirate_tasks" WHERE "pirate_tasks"."hunt_id" = ? AND "pirate_tasks"."completed" = 'f' AND "pirate_tasks"."answer_uploaded" = 't'  [["hunt_id", 1]]
---
  def show
    @hunt = Hunt.find(params[:id])
    @tasks = @hunt.tasks
	 @pirate_tasks = @hunt.pirate_tasks.where(completed: false, answer_uploaded: true)

SELECT  "hunts".* FROM "hunts" WHERE "hunts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "hunts" SET "published" = ?, "updated_at" = ? WHERE "hunts"."id" = ?  [["published", "t"], ["updated_at", "2017-02-03 17:26:57.046824"], ["id", 1]]
---
  def update
    @hunt = Hunt.find(params[:id])
    @hunt.update_attributes(hunt_params)

SELECT  "hunts".* FROM "hunts" WHERE "hunts"."id" = ? LIMIT 1  [["id", 1]]
---
  def join
    @hunt = Hunt.find(params[:id])