app/controllers/pirate_hunts_controller.rb

  def show
    @pirate_hunt = PirateHunt.find(params[:id])
    if(@pirate_hunt.user_id != current_user.id)
      redirect_to(root_path, alert: "You are not authorized to view this page")
    else
      @pirate_tasks = @pirate_hunt.pirate_tasks
      #there is definitely a better way to do this... --kks
      tasks = Task.where(task_type: '1', hunt_id: @pirate_hunt.hunt)
      @photo_tasks = Array.new
      tasks.each do |task|
---
SELECT  "hunts".* FROM "hunts" WHERE "hunts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "pirate_hunts".* FROM "pirate_hunts" WHERE "pirate_hunts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_type" = ? AND "tasks"."hunt_id" = 1  [["task_type", 1]]
SELECT "pirate_tasks".* FROM "pirate_tasks" WHERE "pirate_tasks"."pirate_hunt_id" = ?  [["pirate_hunt_id", 1]]

  def destroy
    PirateHunt.find(params[:id]).destroy
---
DELETE FROM "pirate_hunts" WHERE "pirate_hunts"."id" = ?  [["id", 8]]
SELECT  "pirate_hunts".* FROM "pirate_hunts" WHERE "pirate_hunts"."id" = ? LIMIT 1  [["id", 8]]