app/controllers/pirate_tasks_controller.rb

SELECT  "pirate_tasks".* FROM "pirate_tasks" WHERE "pirate_tasks"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @pirate_task = PirateTask.find(params[:id])

SELECT  "pirate_tasks".* FROM "pirate_tasks" WHERE "pirate_tasks"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "pirate_hunts".* FROM "pirate_hunts" WHERE "pirate_hunts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "pirate_hunts" SET "points" = ?, "updated_at" = ? WHERE "pirate_hunts"."id" = ?  [["points", 100], ["updated_at", "2017-03-27 17:04:58.093297"], ["id", 19]]
UPDATE "pirate_tasks" SET "qr_photo_file_size" = ?, "qr_photo_updated_at" = ?, "qr_photo_file_name" = ?, "updated_at" = ? WHERE "pirate_tasks"."id" = ?  [["qr_photo_file_size", 2554697], ["qr_photo_updated_at", "2017-03-29 17:04:46.372210"], ["qr_photo_file_name", "image.jpg"], ["updated_at", "2017-03-29 17:04:46.384542"], ["id", 10]]
---
  def update

    @pirate_task = PirateTask.find(params[:id]) #gathers info for user performing task from db
    @pirate_hunt = PirateHunt.find(@pirate_task.pirate_hunt_id) #gathers info for user about current hunt
    @pirate_task.update_attribute(:qr_photo, params[:pirate_task][:qr_photo])

SELECT  "pirate_tasks".* FROM "pirate_tasks" WHERE "pirate_tasks"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "pirate_tasks" SET "completed" = ?, "updated_at" = ? WHERE "pirate_tasks"."id" = ?  [["completed", "t"], ["updated_at", "2017-03-27 17:01:17.280361"], ["id", 5]]
---
  def approve
    @pirate_task = PirateTask.find(params[:id])
    @pirate_task.update_attributes(pirate_task_params)

SELECT  "pirate_tasks".* FROM "pirate_tasks" WHERE "pirate_tasks"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "pirate_tasks" SET "answer_uploaded" = ?, "updated_at" = ? WHERE "pirate_tasks"."id" = ?  [["answer_uploaded", "f"], ["updated_at", "2017-03-27 14:23:18.160934"], ["id", 4]]
---
  def reject
    ptask = PirateTask.find(params[:id])
    hunt_creator = ptask.hunt.user # Should this be pirate_hunt? But "Images for Approval" on Hunt page
    if current_user.id == hunt_creator.id
      ptask.submission.clear # Queue the attachment to be deleted
      ptask.update_attributes(completed: false, answer_uploaded: false)